<?php
namespace AntFinancial\Sdk;

class HttpsMain
{

    /**
     * 是否开启短信验证
     *
     * @var unknown
     */
    public static $sendSms = true;

    /**
     * 是否开启验签
     */
    public static $isSign = true;

    /**
     * 身份证
     */
    public static $certNo = "430830198907201280";

    /**
     * 银行卡号
     */
    public static $cardNo = "8888888453427229";

    /**
     * 渠道
     */
    public static $channel = "MYBANK";

    /**
     * 短信验证码
     */
    public static $smsCode = "888888";

    /**
     * 币种
     */
    public static $currencyCode = "156";

    /**
     * 联调环境url
     */
    // public static $reqUrl =
    // "https://fcsupergw.dev.dl.alipaydev.com/open/api/common/request.htm";
    // sit环境url
    public static $reqUrl = "https://fcsupergw.dl.alipaydev.com/open/api/common/request.htm";

    /**
     * 成员机构编号
     *
     * @var unknown
     */
    protected static $partner = "202210000000000005028";

    /**
     * APPID
     * 
     * @var unknown
     */
    protected static $appid = "2016070100005040";

    /**
     * IpRoleID
     * 
     * @var unknown
     */
    protected static $IpRoleID = "226610000051657147614";

    /**
     * 网商银行公钥
     *
     * @var unknown
     */
    protected static $bankPublicKeyFile = 'XmlSignUtil_bank_public_key.pem';

    /**
     * 我方秘钥
     *
     * @var unknown
     */
    protected static $privateKeyFile = 'XmlSignUtil_private_key.pem';

    /**
     * 我方秘钥
     *
     * @var unknown
     */
    protected static $SFTPConfig = [
        'host' => '115.124.16.69',
        'port' => '22',
        'timeout' => 10,
        'username' => 'yqzl001_dada',
        'pass' => 'dada_123456'
    ]
    // 'host' => '192.168.223.132',
    // 'port' => '22',
    // 'timeout' => 10,
    // 'username' => 'mysftp',
    // 'pass' => 'dada_123456'
    ;

    protected static $SFTPConfig_local = [
        'host' => '192.168.223.132',
        'port' => '22',
        'timeout' => 10,
        'username' => 'mysftp',
        'pass' => 'dada_123456'
    ];

    /**
     * 获取IpRoleID
     * 
     * @return string
     */
    public static function getIpRoleID()
    {
        return self::$IpRoleID;
    }

    /**
     * 获取APPID
     * 
     * @return string
     */
    public static function getAppid()
    {
        return self::$appid;
    }

    /**
     * 获取请求的URL
     *
     * @return string
     */
    public static function getReqUrl()
    {
        return self::$reqUrl;
    }

    /**
     * 获取合作方ID
     *
     * @return string
     */
    public static function getPartner()
    {
        return self::$partner;
    }

    /**
     * 获取网商公钥文件名
     */
    public static function getBankPublicKeyFile()
    {
        return self::$bankPublicKeyFile;
    }

    /**
     * 获取我方私钥文件名
     */
    public static function getPrivateKeyFile()
    {
        return self::$privateKeyFile;
    }

    /**
     * 获取支持的银行
     *
     * @return array
     */
    public static function getBanks()
    {
        return self::$bankCode;
    }

    /**
     * 获取SFTP配置
     *
     * @return array
     */
    public static function getSFTPConfig()
    {
        
        if(\App::environment('local')){
            return self::$SFTPConfig_local;
        }
        
        return self::$SFTPConfig;
    }

    public static $bankCode = [
        '100' => '邮储银行',
        '102' => '工商银行',
        '103' => '农业银行',
        '104' => '中国银行',
        '105' => '建设银行',
        '201' => '国家开发银行',
        '301' => '交通银行',
        '302' => '中信银行',
        '303' => '光大银行',
        '304' => '华夏银行',
        '305' => '民生银行',
        '306' => '广发银行',
        '307' => '平安银行',
        '308' => '招商银行',
        '309' => '兴业银行',
        '310' => '浦发银行',
        '311' => '恒丰银行',
        '313' => '华融湘江银行',
        '316' => '浙商银行',
        '317' => '渤海银行',
        '321' => '重庆三峡银行',
        '401' => '上海银行',
        '402' => '厦门银行',
        '403' => '北京银行',
        '404' => '烟台银行',
        '405' => '福建海峡银行',
        '408' => '宁波银行',
        '409' => '齐鲁银行',
        '410' => '福州银行',
        '411' => '焦作市商业银行',
        '412' => '温州银行',
        '413' => '广州银行',
        '414' => '汉口银行',
        '415' => '甘肃银行',
        '417' => '盛京银行',
        '418' => '洛阳银行',
        '419' => '辽阳银行',
        '420' => '大连银行',
        '421' => '苏州银行',
        '422' => '河北银行',
        '423' => '杭州银行',
        '424' => '南京银行',
        '425' => '东莞银行',
        '426' => '金华银行',
        '427' => '乌鲁木齐市商业银行',
        '428' => '绍兴银行',
        '429' => '成都银行',
        '430' => '抚顺银行',
        '431' => '临商银行',
        '432' => '湖北银行',
        '433' => '葫芦岛银行',
        '434' => '天津银行',
        '435' => '郑州银行',
        '436' => '宁夏银行',
        '437' => '珠海华润银行',
        '438' => '齐商银行',
        '439' => '锦州银行',
        '440' => '徽商银行',
        '441' => '重庆银行',
        '442' => '哈尔滨银行',
        '443' => '贵阳银行',
        '444' => '西安银行',
        '446' => '丹东银行',
        '447' => '兰州银行',
        '448' => '南昌银行',
        '449' => '晋商银行',
        '450' => '青岛银行',
        '451' => '吉林银行',
        '454' => '九江银行',
        '455' => '日照银行',
        '456' => '鞍山银行',
        '457' => '秦皇岛市商业银行',
        '458' => '青海银行',
        '459' => '台州银行',
        '461' => '长沙银行',
        '462' => '潍坊银行',
        '463' => '赣州银行',
        '464' => '泉州银行',
        '465' => '营口银行',
        '466' => '富滇银行',
        '467' => '阜新银行',
        '470' => '嘉兴银行',
        '472' => '廊坊银行',
        '473' => '浙江泰隆商业银行',
        '474' => '内蒙古银行',
        '475' => '湖州银行',
        '478' => '广西北部湾银行',
        '479' => '包商银行',
        '481' => '威海市商业银行',
        '483' => '攀枝花市商业银行',
        '485' => '绵阳市商业银行',
        '486' => '泸州市商业银行',
        '487' => '大同市商业银行',
        '488' => '三门峡银行',
        '489' => '广东南粤银行',
        '490' => '张家口市商业银行',
        '491' => '桂林银行',
        '493' => '江苏长江商业银行',
        '495' => '柳州银行',
        '496' => '南充市商业银行',
        '497' => '莱商银行',
        '498' => '德阳银行',
        '500' => '六盘水市商业银行',
        '502' => '曲靖市商业银行',
        '701' => '昆仑银行',
        '1401' => '上海农村商业银行',
        '1402' => '昆山农村商业银行',
        '1403' => '江苏常熟农村商业银行',
        '1404' => '深圳农村商业银行',
        '1405' => '广州农村商业银行',
        '1406' => '浙江萧山农村合作银行',
        '1407' => '广东南海农村商业银行',
        '1408' => '佛山顺德农村商业银行',
        '1409' => '昆明市农村信用合作社联合社',
        '1410' => '湖北省农村信用社联合社',
        '1411' => '徐州市市郊农村信用合作社联合社',
        '1412' => '江苏江阴农村商业银行',
        '1413' => '重庆农村商业银行',
        '1414' => '山东省农村信用社联合社',
        '1415' => '东莞农村商业银行',
        '1416' => '张家港农村商业银行',
        '1417' => '福建省农村信用社联合社',
        '1418' => '北京农村商业银行',
        '1419' => '天津农村合作银行',
        '1420' => '宁波鄞州农村合作银行',
        '1421' => '佛山市三水区农村信用合作社联合社',
        '1422' => '成都市农村信用合作社联合社',
        '1423' => '沧州市农村信用合作社联合社',
        '1424' => '江苏省农村信用合作社联合社',
        '1425' => '江门市新会农村信用合作社联合社',
        '1426' => '高要市农村信用合作社联合社',
        '1427' => '佛山农村商业银行',
        '1428' => '吴江农村商业银行',
        '1429' => '浙江省农村信用社联合社',
        '1430' => '江苏东吴农村商业银行',
        '1431' => '珠海农商银行',
        '1432' => '中山农村信用合作社联合社',
        '1433' => '太仓农村商业银行',
        '1434' => '临汾市尧都市农村信用合作社联合社',
        '1436' => '贵州省农村信用社联合社',
        '1437' => '无锡农村商业银行',
        '1438' => '湖南省农村信用社联合社',
        '1439' => '江西省农村信用社联合社',
        '1440' => '甘肃省农村信用社联合社',
        '1441' => '淄博市商业银行',
        '1442' => '陕西省农村信用社联合社',
        '1501' => '江苏银行',
        '1502' => '邯郸市商业银行',
        '1503' => '邢台银行',
        '1504' => '承德银行',
        '1505' => '沧州银行',
        '1506' => '晋城市商业银行',
        '1507' => '鄂尔多斯银行',
        '1508' => '上饶银行',
        '1509' => '东营市商业银行',
        '1510' => '济宁银行',
        '1511' => '泰安市商业银行',
        '1512' => '德州银行',
        '1513' => '开封市商业银行',
        '1514' => '漯河市商业银行',
        '1515' => '商丘市商业银行',
        '1516' => '南阳市商业银行',
        '1517' => '浙江民泰商业银行',
        '1518' => '龙江银行',
        '1519' => '浙江稠州商业银行',
        '1520' => '安徽省农村信用联社',
        '1521' => '广西壮族自治区农村信用社联合社',
        '1522' => '海南省农村信用社联合社',
        '1523' => '云南省农村信用社联合社',
        '1524' => '宁夏黄河农村商业银行',
        '1525' => '安顺市商业银行',
        '1526' => '安阳市商业银行',
        '1527' => '保定市商业银行',
        '1528' => '成都农商银行',
        '1529' => '广东农村信用社',
        '1530' => '河北省农村信用社联合社',
        '1531' => '鹤壁银行',
        '1532' => '衡水市商业银行',
        '1534' => '晋中市商业银行',
        '1535' => '库尔勒市商业银行',
        '1536' => '乐山市商业银行',
        '1537' => '凉山州商业银行',
        '1538' => '内蒙古农村信用社',
        '1539' => '山西省农村信用社',
        '1540' => '深圳福田银座村镇银行',
        '1541' => '遂宁市商业银行',
        '1542' => '唐山市商业银行',
        '1543' => '天津滨海农村商业银行',
        '1544' => '乌海银行',
        '1545' => '象山县绿叶城市信用社',
        '1546' => '许昌银行',
        '1547' => '雅安市商业银行',
        '1548' => '阳泉市商业银行',
        '1549' => '宜宾市商业银行',
        '1550' => '玉溪市商业银行',
        '1551' => '周口市商业银行',
        '1552' => '自贡市商业银行',
        '1553' => '遵义市商业银行',
        '1554' => '广东华兴银行',
        '1555' => '长安银行',
        '1556' => '北京顺义银座村镇银行',
        '1557' => '浙江景宁银座村镇银行',
        '1558' => '浙江三门银座村镇银行',
        '1559' => '江西赣州银座村镇银行',
        '1560' => '重庆渝北银座村镇银行',
        '1561' => '重庆黔江银座村镇银行',
        '1562' => '吉林省农村信用社联合社',
        '1563' => '浙江省农村信用社联合社',
        '1565' => '颍淮农村商业银行',
        '1567' => '山西长子农村商业银行',
        '1569' => '贵州银行',
        '1570' => '长治商行',
        '1571' => '朝阳银行',
        '1572' => '江苏江南农村商业银行',
        '1573' => '宁波东海银行',
        '1574' => '平顶山银行',
        '1575' => '青海省农村信用社联合社',
        '1576' => '四川省农村信用合作社',
        '1577' => '铁岭商业银行',
        '1578' => '武汉农村商业银行',
        '1579' => '信阳银行',
        '3000' => '汇丰银行',
        '3001' => '东亚银行',
        '3002' => '南洋商业银行',
        '3003' => '恒生银行(中国)有限公司',
        '3004' => '中国银行（香港）有限公司',
        '3005' => '集友银行有限公司',
        '3006' => '创兴银行有限公司',
        '3007' => '星展银行（中国）有限公司',
        '3008' => '永亨银行（中国）有限公司',
        '3009' => '永隆银行',
        '3010' => '花旗银行（中国）有限公司',
        '3011' => '美国银行有限公司',
        '3012' => '摩根大通银行(中国)有限公司',
        '3013' => '三菱东京日联银行(中国）有限公司',
        '3014' => '日本三井住友银行股份有限公司',
        '3015' => '瑞穗实业银行（中国）有限公司',
        '3016' => '日本山口银行股份有限公司',
        '3017' => '外换银行（中国）有限公司',
        '3018' => '友利银行(中国)有限公司',
        '3021' => '韩国产业银行',
        '3022' => '新韩银行(中国)有限公司',
        '3023' => '韩国中小企业银行',
        '3024' => '韩亚银行（中国）有限公司',
        '3025' => '华侨银行（中国）有限公司',
        '3026' => '大华银行（中国）有限公司',
        '3028' => '泰国盘谷银行(大众有限公司)',
        '3029' => '奥地利中央合作银行股份有限公司',
        '3030' => '比利时联合银行股份有限公司',
        '3031' => '比利时富通银行有限公司',
        '3032' => '荷兰银行',
        '3033' => '荷兰安智银行股份有限公司',
        '3034' => '渣打银行',
        '3035' => '英国苏格兰皇家银行公众有限公司',
        '3036' => '法国兴业银行（中国)有限公司',
        '3037' => '法国东方汇理银行股份有限公司',
        '3038' => '法国外贸银行股份有限公司',
        '3039' => '德国德累斯登银行股份公司',
        '3040' => '德意志银行（中国）有限公司',
        '3041' => '德国商业银行股份有限公司',
        '3042' => '德国西德银行股份有限公司',
        '3043' => '德国巴伐利亚州银行',
        '3044' => '德国北德意志州银行',
        '3045' => '意大利联合圣保罗银行股份有限公司',
        '3046' => '瑞士信贷银行股份有限公司',
        '3047' => '瑞士银行',
        '3048' => '加拿大丰业银行有限公司',
        '3049' => '加拿大蒙特利尔银行有限公司',
        '3050' => '澳大利亚和新西兰银行集团有限公司',
        '3051' => '摩根士丹利国际银行（中国）有限公司',
        '3052' => '联合银行(中国)有限公司',
        '3053' => '荷兰合作银行有限公司',
        '3054' => '厦门国际银行',
        '3055' => '法国巴黎银行（中国）有限公司',
        '3056' => '华商银行',
        '3057' => '华一银行'
    ];
}