<?php
namespace App\Services\Merchants;

trait FBSdkConstTrait
{
    /**
     * IA.1 银行号（2位）
     *
     * @var unknown
     */
    protected $DA1_BBKNBR = [
        '01' => '总行',
        '03' => '总行会计部',
        '10' => '北京',
        '12' => '离岸分行',
        '13' => '总行离岸中心',
        '20' => '广州',
        '21' => '上海',
        '22' => '天津',
        '23' => '重庆',
        '24' => '沈阳',
        '25' => '南京',
        '27' => '武汉',
        '28' => '成都',
        '29' => '西安',
        '35' => '太原',
        '37' => '郑州',
        '38' => '石家庄',
        '39' => '唐山',
        '41' => '大连',
        '43' => '长春',
        '45' => '哈尔滨',
        '47' => '呼和浩特',
        '51' => '银川',
        '52' => '苏州',
        '53' => '青岛',
        '54' => '宁波',
        '55' => '合肥',
        '56' => '济南',
        '57' => '杭州',
        '58' => '温州',
        '59' => '福州',
        '60' => '泉州',
        '62' => '无锡',
        '69' => '东莞',
        '71' => '南宁',
        '72' => '西宁',
        '73' => '长沙',
        '75' => '深圳',
        '77' => '佛山',
        '79' => '南昌',
        '85' => '贵阳',
        '87' => '昆明',
        '89' => '海口',
        '91' => '乌鲁木齐',
        '92' => '厦门',
        '93' => '兰州',
        '97' => '香港',
    ];
    
    
    
    /**
     * IA.1 银行号（2位）
     *
     * @var unknown
     */
    protected $IA1_QRYBBK = [
        'AB' => '农业银行',
        'BB' => '中国银行',
        'BJ' => '北京银行',
        'CB' => '招商银行',
        'CC' => '建设银行',
        'CI' => '兴业银行',
        'CM' => '交通银行',
        'CT' => '中信银行',
        'CU' => '中国银联',
        'EB' => '光大银行',
        'FB' => '福州商行',
        'GB' => '广东发展银行',
        'HB' => '华夏银行',
        'IB' => '工商银行',
        'MB' => '民生银行',
        'NJ' => '南京银行',
        'PA' => '平安银行',
        'PB' => '浦发银行',
        'QB' => '重庆银行',
        'SB' => '深圳发展银行',
        'SH' => '上海银行',
        'XA' => '锦州银行',
        'XB' => '大连银行',
        'XC' => '鞍山市商业银行',
        'XD' => '葫芦岛银行',
        'XE' => '青岛银行',
        'XF' => '齐商银行',
        'XG' => '烟台银行',
        'XH' => '济宁银行',
        'XI' => '泰安市商业银行',
        'XJ' => '临商银行',
        'XK' => '东营市商业银行',
        'XL' => '威海市商业银行',
        'XM' => '日照银行',
        'XN' => '莱商银行',
        'XO' => '安徽省农村信用社联合社',
        'XP' => '长沙银行',
        'XQ' => '南昌银行',
        'XR' => '上饶银行',
        'XS' => '广西北部湾银行',
        'XT' => '上海农村商业银行',
        'XU' => '上海银行',
        'XV' => '上海浦东发展银行',
        'XW' => '苏州银行',
        'XX' => '张家港农村商业银行',
        'XY' => '昆山农村商业银行',
        'XZ' => '杭州银行',
        'YA' => '浙商银行',
        'YB' => '浙江稠州商业银行',
        'YC' => '浙江泰隆商业银行',
        'YD' => '温州银行',
        'YE' => '鄞州银行',
        'YF' => '宁波银行',
        'YG' => '湖州银行',
        'YH' => '厦门银行',
        'ZA' => '天津银行',
        'ZB' => '广州银行',
        'ZC' => '平安银行',
        'ZD' => '东莞银行',
        'ZE' => '广州农商行',
        'ZF' => '顺德农商行',
        'ZG' => '天津农合',
        'ZH' => '渤海银行',
        'ZI' => '北京农商行',
        'ZJ' => '深圳农商行',
        'ZK' => '东莞农商行',
        'ZL' => '中国邮政储蓄',
        'ZM' => '外换银行',
        'ZN' => '新韩银行中国',
        'ZO' => '韩亚银行'
    ];

    /**
     * A.2 返回代码
     *
     * @var unknown
     */
    protected $DA2_RETCOD = [
        '-9' => '其它错误',
        '-7' => '用户取消操作',
        '-6' => '不是证书卡用户',
        '-5' => '请求太频繁',
        '-4' => '尚未登录系统',
        '-3' => '数据格式错误',
        '-2' => '执行失败',
        '-1' => '提交主机失败',
        '0' => '成功'
    ];

    /**
     * A.3 货币代码表
     *
     * @var unknown
     */
    protected $DA3_CCYNBR = [
        '10' => '人民币',
        '21' => '港币',
        '29' => '澳元',
        '32' => '美元',
        '35' => '欧元',
        '39' => '加拿大元',
        '43' => '英镑',
        '65' => '日元',
        '69' => '新加坡元',
        '83' => '挪威克朗',
        '85' => '丹麦克朗',
        '87' => '瑞士法郎',
        '88' => '瑞典克朗'
    ];

    /**
     * A.4 业务代码
     *
     * @var unknown
     */
    protected $DA4_BUSCOD = [
        'N01010' => '帐务查询',
        'N02010' => '受限收方编辑',
        'N02020' => '内部转帐',
        'N02030' => '支付',
        'N02031' => '直接支付',
        'N02032' => '商务支付业务',
        'N02040' => '集团支付',
        'N02041' => '直接集团支付',
        'N03010' => '代发工资',
        'N03020' => '代发',
        'N03030' => '代扣',
        'N04010' => '信用查询',
        'N04020' => '自助贷款',
        'N04030' => '委托贷款',
        'N05010' => '信用证',
        'N06010' => '票据',
        'N07010' => '外汇汇款',
        'N08010' => '定活互转',
        'N08020' => '通知存款',
        'N09010' => '代理清算',
        'N15010' => '集团资金余额管理',
        'N15011' => '资金余额管理大额划拨',
        'N15020' => '集团委贷现金池',
        'N29010' => '人行电子票据（企业）',
        'N29020' => '人行电子票据（同业）',
        'N31010' => '网银贷记',
        'N31011' => '网银借记',
        'N31012' => '第三方贷记',
        'N31013' => '跨行账户信息查询'
    ];

    /**
     * A.5 业务请求状态
     *
     * @var unknown
     */
    protected $DA5_REQSTS = [
        'AUT' => '等待审批',
        'NTE' => '终审完毕',
        'WCF' => '订单待确认（商务支付用）',
        'BNK' => '银行处理中',
        'FIN' => '完成',
        'ACK' => '等待确认(委托贷款用)',
        'APD' => '待银行确认(国际业务用)',
        'OPR' => '数据接收中（代发）'
    ];

    /**
     * A.6 业务处理结果
     *
     * @var unknown
     */
    protected $DA6_RTNFLG = [
        'S' => '成功', // 银行支付成功
        'F' => '失败', // 银行支付失败
        'B' => '退票', // 银行支付被退票
        'R' => '否决', // 企业审批否决
        'D' => '过期', // 企业过期不审批
        'C' => '撤消', // 企业撤销
        'M' => '商户撤销订单', // 商务支付
        'V' => '拒绝', // 委托贷款被借款方拒绝
        'U' => '银行挂账'
    ];

    /**
     *A.16 消息类型
     * @var unknown
     */
    protected $DA16_MSGTYP = [
        'NCBCHOPR' => '批量支付经办结果通知',
        'NCCRTTRS' => '到帐通知',
        'NCDBTTRS' => '付款通知',
        'NCDRTPAY' => '直接支付结果通知',
        'NCBUSFIN' => '业务完成通知'
    ];

    /**
     * A.1 银行号（2位）
     * 分行号 => 分行名称
     * BBKNBR => C_BBKNBR
     *
     * @var unknown
     */
    protected $IA1_BBKNBR = [
        '10' => '北京',
        '12' => '离岸分行',
        '13' => '总行离岸中心',
        '20' => '广州',
        '21' => '上海',
        '22' => '天津',
        '23' => '重庆',
        '24' => '沈阳',
        '25' => '南京',
        '27' => '武汉',
        '28' => '成都',
        '29' => '西安',
        '35' => '太原',
        '37' => '郑州',
        '38' => '石家庄',
        '39' => '唐山',
        '41' => '大连',
        '43' => '长春',
        '45' => '哈尔滨',
        '47' => '呼和浩特',
        '51' => '银川',
        '52' => '苏州',
        '53' => '青岛',
        '54' => '宁波',
        '55' => '合肥',
        '56' => '济南',
        '57' => '杭州',
        '58' => '温州',
        '59' => '福州',
        '60' => '泉州',
        '62' => '无锡',
        '69' => '东莞',
        '71' => '南宁',
        '72' => '西宁',
        '73' => '长沙',
        '75' => '深圳',
        '77' => '佛山',
        '79' => '南昌',
        '85' => '贵阳',
        '87' => '昆明',
        '89' => '海口',
        '91' => '乌鲁木齐',
        '92' => '厦门',
        '93' => '兰州',
        '97' => '香港',
        '03' => '总行会计部',
        '01' => '总行'
    ];

    /**
     * 收款行行号
     *
     * @var unknown
     */
    protected $_CDTBRD = [
        '上海农商银行' => '322290000011',
        '上海农村商业银行' => '322290000011',
        '上海浦东发展银行' => '310290000013',
        '上海银行' => '325290000012',
        '上饶银行' => '313433076801',
        '东亚银行（中国）有限公司' => '502290000006',
        '东莞农村商业银行' => '402602000018',
        '东莞农村商业银行股份有限公司' => '402602000018',
        '东莞银行' => '313602088017',
        '东莞银行股份有限公司' => '313602088017',
        '东营银行' => '313455000018',
        '东营银行股份有限公司' => '313455000018',
        '中信银行' => '302100011000',
        '中信银行股份有限公司' => '302100011000',
        '中原银行' => '313491099996',
        '中原银行股份有限公司' => '313491099996',
        '中原银行股份有限公司商丘分行' => '313506082510',
        '中原银行股份有限公司漯河分行' => '313504000010',
        '中国光大银行' => '303100000006',
        '中国农业银行' => '103100000026',
        '中国农业银行股份有限公司' => '103100000026',
        '中国工商银行' => '102100099996',
        '中国建设银行' => '105100000017',
        '中国建设银行股份有限公司总行' => '105100000017',
        '中国民生银行' => '305100000013',
        '中国邮政储蓄银行' => '403100000004',
        '中国邮政储蓄银行有限责任公司' => '403100000004',
        '中国银行' => '104100000004',
        '中国银行总行' => '104100000004',
        '临商银行' => '313473070018',
        '临商银行股份有限公司' => '313473070018',
        '乌鲁木齐市商业银行' => '313881000002',
        '乌鲁木齐市商业银行清算中心' => '313881000002',
        '九江银行股份有限公司' => '313424076706',
        '云南省农村信用社' => '402731057238',
        '云南省农村信用社联合社' => '402731057238',
        '交通银行' => '301290000007',
        '企业银行' => '596110000013',
        '企业银行（中国）有限公司' => '596110000013',
        '佛山顺德农村商业银行股份有限公司' => '314588000016',
        '兰州银行股份有限公司' => '313821001016',
        '兴业银行' => '309391000011',
        '兴业银行总行' => '309391000011',
        '内蒙古银行' => '313191000011',
        '包商银行股份有限公司' => '313192000013',
        '北京农村商业银行' => '402100000018',
        '北京农村商业银行股份有限公司' => '402100000018',
        '北京银行' => '313100000013',
        '北京顺义银座村镇银行' => '320100010011',
        '北京顺义银座村镇银行股份有限公司' => '320100010011',
        '华夏银行' => '304100040000',
        '华夏银行股份有限公司总行' => '304100040000',
        '南京银行' => '313301008887',
        '南京银行股份有限公司' => '313301008887',
        '南充市商业银行' => '313673093259',
        '南充市商业银行股份有限公司' => '313673093259',
        '南昌银行' => '313421087506',
        '厦门银行' => '313393080005',
        '厦门银行股份有限公司' => '313393080005',
        '友利银行' => '593100000020',
        '友利银行(中国)有限公司' => '593100000020',
        '台州银行' => '313345001665',
        '台州银行股份有限公司' => '313345001665',
        '吉林农村信用社' => '402241000015',
        '吉林省农村信用社联合社（不办理转汇业务）' => '402241000015',
        '吉林银行' => '313241066661',
        '吴江农村商业银行' => '314305400015',
        '吴江农村商业银行清算中心' => '314305400015',
        '哈尔滨银行结算中心' => '313261000018',
        '商丘市商业银行' => '313506082510',
        '嘉兴银行清算中心' => '313335081005',
        '嘉兴银行股份有限公司清算中心(不对外办理业务）' => '313335081005',
        '四川省农村信用社联合社' => '402651020006',
        '四川省联社' => '402651020006',
        '大连银行' => '313222080002',
        '天津农商银行' => '317110010019',
        '天津农村商业银行股份有限公司' => '317110010019',
        '天津银行' => '313110000017',
        '天津银行股份有限公司' => '313110000017',
        '太仓农商行' => '314305106644',
        '太仓农村商业银行' => '314305106644',
        '威海市商业银行' => '313465000010',
        '宁夏银行' => '313871000007',
        '宁夏银行总行清算中心' => '313871000007',
        '宁夏黄河农村商业银行股份有限公司' => '402871099996',
        '宁波鄞州农村合作银行' => '402332010004',
        '宁波银行' => '313332082914',
        '宁波银行股份有限公司' => '313332082914',
        '安徽省农村信用社联合社' => '402361018886',
        '安徽省农村信用联社资金清算中心' => '402361018886',
        '富滇银行' => '313731010015',
        '富滇银行股份有限公司运营管理部' => '313731010015',
        '山东省农村信用社联合社' => '402451000010',
        '山东省农联社' => '402451000010',
        '常熟农村商业银行' => '314305506621',
        '平安银行（原深圳发展银行）' => '307584007998',
        '平顶山银行' => '313495081900',
        '平顶山银行股份有限公司' => '313495081900',
        '广东华兴银行' => '313586000006',
        '广东华兴银行股份有限公司' => '313586000006',
        '广东南粤银行股份有限公司' => '313591001001',
        '广发银行股份有限公司' => '306581000003',
        '广州农村商业银行' => '314581000011',
        '广州农村商业银行股份有限公司' => '314581000011',
        '广州银行' => '313581003284',
        '广西农村信用社（合作银行）' => '402611099974',
        '广西北部湾银行' => '313611001018',
        '广西壮族自治区农村信用社联合社' => '402611099974',
        '廊坊银行' => '313146000019',
        '张家口市商业银行' => '313138000019',
        '张家口市商业银行股份有限公司' => '313138000019',
        '张家港农村商业银行' => '314305670002',
        '德州银行' => '313468000015',
        '德州银行股份有限公司' => '313468000015',
        '德阳银行' => '313658000014',
        '德阳银行股份有限公司' => '313658000014',
        '徽商银行' => '319361000013',
        '徽商银行股份有限公司' => '319361000013',
        '恒丰银行' => '315456000105',
        '成都银行' => '313651099999',
        '承德银行' => '313141052422',
        '承德银行股份有限公司' => '313141052422',
        '招商银行' => '308584000013',
        '招商银行股份有限公司' => '308584000013',
        '攀枝花市商业银行' => '313656000019',
        '新韩银行中国' => '595100000007',
        '新韩银行（中国）有限公司' => '595100000007',
        '日照银行' => '313473200011',
        '日照银行股份有限公司' => '313473200011',
        '昆仑银行' => '313882000012',
        '昆仑银行股份有限公司' => '313882000012',
        '昆山农村商业银行' => '314305206650',
        '晋商银行网上银行' => '313161000017',
        '晋商银行股份有限公司' => '313161000017',
        '晋城银行' => '313168000003',
        '杭州银行' => '313331000014',
        '杭州银行股份有限公司' => '313331000014',
        '枣庄银行' => '313454000016',
        '枣庄银行股份有限公司' => '313454000016',
        '柳州银行' => '313614000012',
        '柳州银行股份有限公司清算中心' => '313614000012',
        '桂林银行股份有限公司' => '313617000018',
        '汉口银行' => '313521000011',
        '汉口银行资金清算中心' => '313521000011',
        '江苏常熟农村商业银行股份有限公司清算中心' => '314305506621',
        '江苏江阴农村商业银行股份有限公司' => '314302200018',
        '江苏省农村信用社联合社' => '402301099998',
        '江苏省农村信用社联合社(不对外)' => '402301099998',
        '江苏银行股份有限公司' => '313301099999',
        '江苏长江商业银行' => '313312300018',
        '江苏长江商行' => '313312300018',
        '江西赣州银座村镇银行' => '320428090311',
        '江西赣州银座村镇银行股份有限公司' => '320428090311',
        '江阴农商银行' => '314302200018',
        '沧州银行' => '313143005157',
        '河北银行股份有限公司' => '313121006888',
        '泉州银行' => '313397075189',
        '泉州银行股份有限公司(不对外营业)' => '313397075189',
        '泰安市商业银行' => '313463000993',
        '洛阳银行' => '313493080539',
        '济宁银行' => '313461000012',
        '济宁银行股份有限公司' => '313461000012',
        '浙商银行' => '316331000018',
        '浙江三门银座村镇银行' => '320345790018',
        '浙江三门银座村镇银行股份有限公司' => '320345790018',
        '浙江景宁银座村镇银行' => '320343800019',
        '浙江景宁银座村镇银行股份有限公司' => '320343800019',
        '浙江民泰商业银行' => '313345400010',
        '浙江泰隆商业银行' => '313345010019',
        '浙江省农村信用社' => '402331000007',
        '浙江省农村信用社联合社' => '402331000007',
        '浙江稠州商业银行' => '313338707013',
        '海南省农村信用社' => '402641000014',
        '海南省农村信用社联合社资金清算中心' => '402641000014',
        '海口联合农村商业银行' => '314641000014',
        '海口联合农村商业银行股份有限公司' => '314641000014',
        '深圳农商行' => '402584009991',
        '深圳农村商业银行股份有限公司' => '402584009991',
        '深圳福田银座村镇银行' => '320584002002',
        '深圳福田银座村镇银行股份有限公司' => '320584002002',
        '渤海银行' => '318110000014',
        '渤海银行股份有限公司' => '318110000014',
        '温州银行' => '313333007331',
        '温州银行股份有限公司' => '313333007331',
        '湖北农信' => '402521000032',
        '湖北省农村信用社联合社结算中心' => '402521000032',
        '湖北银行' => '313521006000',
        '湖北银行股份有限公司' => '313521006000',
        '湖州银行' => '313336071575',
        '湖州银行股份有限公司' => '313336071575',
        '漯河市商业银行' => '313504000010',
        '潍坊银行' => '313458000013',
        '烟台银行' => '313456000108',
        '烟台银行股份有限公司' => '313456000108',
        '珠海华润银行清算中心' => '313585000990',
        '珠海华润银行股份有限公司清算中心' => '313585000990',
        '福建海峡银行' => '313391080007',
        '福建海峡银行股份有限公司' => '313391080007',
        '福建省农村信用社' => '402391000068',
        '福建省农村信用社联合社' => '402391000068',
        '绍兴银行' => '313337009004',
        '绍兴银行股份有限公司营业部' => '313337009004',
        '绵阳市商业银行' => '313659000016',
        '自贡市商业银行清算中心' => '313655091983',
        '苏州银行' => '313305066661',
        '苏州银行股份有限公司' => '313305066661',
        '莱商银行' => '313463400019',
        '营口银行' => '313228000276',
        '营口银行股份有限公司资金清算中心' => '313228000276',
        '葫芦岛银行' => '313227600018',
        '葫芦岛银行股份有限公司' => '313227600018',
        '西安银行' => '313791000015',
        '西安银行股份有限公司' => '313791000015',
        '贵阳市商业银行' => '313701098010',
        '贵阳银行' => '313701098010',
        '赣州银行' => '313428076517',
        '赣州银行股份有限公司' => '313428076517',
        '邢台银行' => '313131000016',
        '邢台银行股份有限公司' => '313131000016',
        '邯郸市商业银行' => '313127000013',
        '邯郸市商业银行股份有限公司' => '313127000013',
        '郑州银行' => '313491000232',
        '鄂尔多斯银行' => '313205057830',
        '鄂尔多斯银行股份有限公司' => '313205057830',
        '鄞州银行' => '402332010004',
        '重庆农村商业银行' => '314653000011',
        '重庆农村商业银行股份有限公司' => '314653000011',
        '重庆渝北银座村镇银行' => '320653000104',
        '重庆渝北银座村镇银行股份有限公司' => '320653000104',
        '重庆银行' => '313653000013',
        '重庆银行股份有限公司' => '313653000013',
        '重庆黔江银座村镇银行' => '320687000016',
        '重庆黔江银座村镇银行股份有限公司' => '320687000016',
        '锦州银行' => '313227000012',
        '长安银行' => '313791030003',
        '长安银行股份有限公司' => '313791030003',
        '长沙银行' => '313551088886',
        '长沙银行股份有限公司' => '313551088886',
        '阜新银行结算中心' => '313229000008',
        '青岛银行' => '313452060150',
        '青海银行' => '313851000018',
        '青海银行股份有限公司营业部' => '313851000018',
        '鞍山市商业银行' => '313223007007',
        '韩亚银行' => '597100000014',
        '韩亚银行（中国）有限公司' => '597100000014',
        '顺德农村商业银行' => '314588000016',
        '黄河农村商业银行' => '402871099996',
        '齐商银行' => '313453001017',
        '齐鲁银行' => '313451000019',
        '龙江银行' => '313261099913',
        '龙江银行股份有限公司' => '313261099913'
    ];


    /**
     *A.48交易状态表
     * @var unknown
     */
    protected $IA48_TRXSTS = [
        '00' => '初始',
        '01' => '已取消',
        '02' => '经办中',
        '10' => '已发送',
        '11' => '已拒绝',
        '12' => '已成功',
        '13' => '已撤销',
        '14' => '已失败',
        '15' => '贷记已冲账',
        '16' => '收到 URL',
        '18' => '已挂账',
        '20' => '回执已发送',
        '21' => '已拒绝 ( 提回 )',
        '22' => '已成功 ( 提回 )',
        '23' => '已撤销 ( 提回 )',
        '24' => '已失败 ( 提回 )',
        '25' => '校验通过',
        '26' => '发出 URL',
        '27' => '经办中（ URL ）',
        '28' => '已挂账 ( 提回 )',
        '29' => '已扣款'
    ];

    
    /**
     * 通过银行代码确定银行类别是否为招商
     * @param unknown $code
     * @return boolean
     *  是招行返回true，否者false
     */
    public function isCmb($code)
    {
        $merch_code = '308584000013';
        return $code == $merch_code;
    }

    public function getBankCodeByName($name)
    {
        return array_get($this->_CDTBRD, $name, false);
    }

    public function get_random_CDTBRD()
    {
        return array_rand($this->_CDTBRD, 1);
    }
}